problem link: https://leetcode.com/problems/tree-node/description/?lang=pythondata

In [1]:
import pandas as pd

### Generating test cases

In [32]:
seat=pd.read_csv('./test_data/p626_seat.csv',delimiter='|')
seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

In [4]:
seat.dtypes

id          int64
student    object
dtype: object

In [5]:
seat.columns

Index(['id', 'student'], dtype='object')

### Solving problem

In [6]:
len(seat)

5

In [7]:
len(seat)//2

2

In [23]:
for i in range((len(seat)//2)):
    print(i*2)

0
2

In [33]:
seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

In [13]:
seat.loc[1,'student']

'Doris'

In [17]:
seat.loc[0,'student']

'Abbot'

In [28]:
seat.loc[0,'student'],seat.loc[1,'student']=seat.loc[1,'student'],seat.loc[0,'student']

In [29]:
seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

In [34]:
for i in range((len(seat)//2)):
    j=i*2
    print(j)
    seat.loc[j,'student'],seat.loc[j+1,'student']=seat.loc[j+1,'student'],seat.loc[j,'student']

0
2

In [35]:
seat

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames

### Preparing Submission function

In [36]:
import pandas as pd
def exchange_seats(seat: pd.DataFrame) -> pd.DataFrame:
    for i in range((len(seat)//2)):
        j=i*2
        seat.loc[j,'student'],seat.loc[j+1,'student']=seat.loc[j+1,'student'],seat.loc[j,'student']

    return seat

### Testing the submission function

In [37]:
seat=pd.read_csv('./test_data/p626_seat.csv',delimiter='|')
seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

In [38]:
exchange_seats(seat=seat)

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames